//  5. Написать программу вычисления значения функции y=f(a)

double x = Convert.ToDouble(Console.ReadLine());
double f = x*x+1;
Console.WriteLine(f);